= 良くないプロジェクトをできるだけ良くする

: author
  @i544c

: institution
  未来大 x 琉大 中継LT大会2019

: allotted-time
  5m


= 自己紹介🙄
* 佐藤 礼於
* Twitter ((<"@_leo_isaac"|URL:https://twitter.com/_leo_isaac>))
* Rubyが好き
  * 上映会で人を募る screening.i544c.me
* デレマスが好き
  * 7thライブ幕張公演は全日現地💪


= お断り⚠️
世には色んなクソプロジェクトが溢れていますが、ここでは特にIT分野でのクソプロジェクトについて述べます。


= Hello, kuso project👊
人は時にクソプロジェクトに出会うことがあります。
あなたが取れる選択肢はいくつかあります。
* 戦う
* 病む
* 逃げる etc...


= 上に立つ🦹
クソプロジェクトでは、全員に発言権が与えられていません。

まずは上に立つ必要があります。


= 全員に人権を👶
メンバーは人です。

誰もが気軽に相談したり、意見を述べられるようにしましょう。


= 信頼できる人を見定める🕵️
まずは人を見ます。

その人が書くコードは信頼できますか？


= 信頼できるドキュメント📝
チケット管理してますか？チケットはどこまで溜まっていますか？漏れはないですか？

Wikiはありますか？Wikiの鮮度は良いですか？


= 信頼できるサーバ🖥️
そのサーバは落ちませんか？バックアップは定期的に取っていますか？


= 信頼できるところをどんどん広げていく⛓️
人の書くコードが信頼できないなら、すぐにEditorConfigとLinterを導入しましょう。

(CI/CDは当たり前)


= ドキュメントにもどんどん書いてく📝📝📝
タスクが決まったら、チケットに書いていく。
そのタスクに関するあらゆる物事も、チケットのメッセージ欄にどんどん書いていく。

Wikiの鮮度を高め、積極的に情報を書きましょう。勿論、他人が分かりやすく。


= 信頼できるサーバを手に入れる🖥️🖥️🖥️
予算を付けて、良いサーバを導入しましょう。

正しいバックアップを定期的に取る仕組みを作りましょう。


= 信頼できるコードを書いていく👨‍💻👩‍💻
プロジェクト全体のコードが全く信頼できなければ、作り直します。

信頼できないコードの保守は一番ヤバい。


= 継続的なバージョンアップ🆙
言語、ライブラリ、フレームワークは勿論。

ミドルウェア、OS、etc...。

Ubuntu12、PHP5.3、CakePHP1のプロジェクトとか...

((<greenkeeper.io|URL:greenkeeper.io>))


= わけの分からないコードを残すな💩
  `ai`という変数がある。何の略か。


= 良いコード、良い本を読もう📚📚📚
* ベタープログラマー
  * 特に7章の『汚物の中で転げ回る』は最高
* リーダブルコード
